Case_set_up/Blow_Ratio_Effect/M1_05/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet_gas
    {
        type            zeroGradient;
    }
	inlet_coolant
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    topwall
    {
        type            zeroGradient;
    }
	bottom_plate
    {
        type            zeroGradient;
    }
	hole_wall
    {
        type            zeroGradient;
    }
	frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
