Case_set_up/Blow_Ratio_Effect/M1_05/Allrun
blockMesh
decomposePar 
mpirun -np 6 buoyantBoussinesqSimpleFoam -parallel 
reconstructPar 

