Case_set_up/Blow_Ratio_Effect/M1_05/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet_gas
    {
        type            patch;
        nFaces          65;
        startFace       35752;
    }
    inlet_coolant
    {
        type            patch;
        nFaces          10;
        startFace       35817;
    }
    outlet
    {
        type            patch;
        nFaces          65;
        startFace       35827;
    }
    topwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          275;
        startFace       35892;
    }
    bottom_plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          265;
        startFace       36167;
    }
    hole_wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          36;
        startFace       36432;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          36110;
        startFace       36468;
    }
)

// ************************************************************************* //
